Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::Branch Class Referencefinal
MEP Element Manager
A branch is a specific type of fitting that acts as an outlet from a large pipe to a smaller pipe or one of equal size. More...
#include <MEPBranch.hpp>
 Inheritance diagram for ACAPI::MEP::v1::Branch:
 Public Member Functions
BranchDefault  | PickUpDefault () const
Picks up the Default from the Branch.
std::optional< double >  | GetInsulationThickness () const
double  | GetLength () const
double  | GetBranchLength () const
double  | GetBranchAngle () const
double  | GetBranchOffset () const
Domain  | GetDomain () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< void >  | Inject (const BranchDefault &branchDefault)
Injects the Default settings into the Branch.
Result< void >  | SetInsulationThickness (double thickness)
Sets the insulation thickness of the Branch.
 void  | RemoveInsulation ()
Removes the insulation from the Branch.
 Public Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::v1::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< Branch >  | Get (const UniqueID &uniqueId)
Returns a Branch.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs a ModifiableElementBase with the IElementBaseImpl.
Modifier (ModifiableElementBase &parent)
Constructs a Modifier with the parent ModifiableElementBase.
 void  | FinalizeModification () override
Finalizes the modifications.
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::v1::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A branch is a specific type of fitting that acts as an outlet from a large pipe to a smaller pipe or one of equal size.
Since
Archicad 27
This type of element can be placed at intersections
Example code snippets from Test / New MEP
Getters
 ACAPI::Result<Branch> branch = Branch::Get (id);
 if (branch.IsErr ()) {
 ACAPI_WriteReport (branch.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter branchReporter;
 branchReporter.Add ("Branch details");
 branchReporter.SetTabCount (1);
 branchReporter.Add ("Main axis length", branch->GetLength ());
 branchReporter.Add ("Branch length", branch->GetBranchLength ());
 branchReporter.Add ("Branch angle", branch->GetBranchAngle ());
 branchReporter.Add ("Branch offset", branch->GetBranchOffset ());
 std::optional<double> insulationThickness = branch->GetInsulationThickness ();
 insulationThickness.has_value () ? branchReporter.Add ("It has insulation. Thickness", *insulationThickness) : branchReporter.Add ("It has no insulation");
 branchReporter.Write ();
 Modification
 ACAPI::Result<Branch> branch = Branch::Get (id);
 if (branch.IsErr ()) {
 ACAPI_WriteReport (branch.UnwrapErr ().text.c_str (), false);
 return branch.UnwrapErr ().kind;
 }
 bool canHaveInsulation = branch->GetDomain () != Domain::CableCarrier;
 ACAPI::Result<void> modifyResult = branch->Modify ([&canHaveInsulation](Branch::Modifier& modifier) -> GSErrCode {
 if (canHaveInsulation) {
 ACAPI::Result<void> result = modifier.SetInsulationThickness (0.1);
 if (result.IsErr ())
 return result.UnwrapErr ().kind;
 }
 return NoError;
 }, "Modify Parameters of Branch.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 return NoError;
Member Function Documentation
◆ Get()
 static Result< Branch > ACAPI::MEP::v1::Branch::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a Branch.
Parameters
uniqueId | The UniqueID of the requested Branch.
Returns
If the uniqueId belongs to a Branch, returns the object associated to it, otherwise Error.
◆ GetBranchAngle()
 double ACAPI::MEP::v1::Branch::GetBranchAngle  |  ( |   | ) |   const
Returns
Returns the angle of the branch of the element in degrees.
◆ GetBranchLength()
 double ACAPI::MEP::v1::Branch::GetBranchLength  |  ( |   | ) |   const
Returns
Returns the length of the branch of the Branch.
◆ GetBranchOffset()
 double ACAPI::MEP::v1::Branch::GetBranchOffset  |  ( |   | ) |   const
Returns
Returns the offset of the branch of the Branch.
◆ GetDomain()
 Domain ACAPI::MEP::v1::Branch::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the Branch.
◆ GetInsulationThickness()
 std::optional< double > ACAPI::MEP::v1::Branch::GetInsulationThickness  |  ( |   | ) |   const
Returns
Returns the insulation thickness if the Branch has insulation, otherwise std::nullopt. Branches of cable carrier domain cannot have insulation.
◆ GetLength()
 double ACAPI::MEP::v1::Branch::GetLength  |  ( |   | ) |   const
Returns
Returns the length of the main axis of the Branch.
◆ Inject()
 Result< void > ACAPI::MEP::v1::Branch::Inject  |  ( |  const BranchDefault &  |  branchDefault | )
Injects the Default settings into the Branch.
Parameters
branchDefault | The Default what will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::Branch::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 BranchDefault ACAPI::MEP::v1::Branch::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the Branch.
Returns
Returns a BranchDefault with the parameters of the object it was called for.
◆ SetInsulationThickness()
 Result< void > ACAPI::MEP::v1::Branch::SetInsulationThickness  |  ( |  double  |  thickness | )
Sets the insulation thickness of the Branch.
Parameters
thickness | The value to be set. It should be a positive number.
Returns
Returns an error if the Branch is of cable carrier domain, otherwise nothing.